; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-2-2-5-161)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p2-1 - location
	p2-3 - location
	p4-0 - location
	p4-2 - location
	p1-3 - location
	p1-4 - location
	p0-1 - location
	p0-2 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s4)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s1)
	(at package2 s2)
	(at package3 s3)
	(at package4 s1)
	(at package5 s4)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 12)
	(= (time-to-walk p2-1 s2) 12)
	(= (time-to-walk s1 p2-1) 2)
	(= (time-to-walk p2-1 s1) 2)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 13)
	(= (time-to-walk p2-3 s2) 13)
	(= (time-to-walk s3 p2-3) 25)
	(= (time-to-walk p2-3 s3) 25)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 11)
	(= (time-to-walk p4-0 s4) 11)
	(= (time-to-walk s0 p4-0) 10)
	(= (time-to-walk p4-0 s0) 10)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 7)
	(= (time-to-walk p4-2 s4) 7)
	(= (time-to-walk s2 p4-2) 20)
	(= (time-to-walk p4-2 s2) 20)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 5)
	(= (time-to-walk p1-3 s1) 5)
	(= (time-to-walk s3 p1-3) 25)
	(= (time-to-walk p1-3 s3) 25)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 19)
	(= (time-to-walk p1-4 s1) 19)
	(= (time-to-walk s4 p1-4) 21)
	(= (time-to-walk p1-4 s4) 21)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 27)
	(= (time-to-walk p0-1 s0) 27)
	(= (time-to-walk s1 p0-1) 12)
	(= (time-to-walk p0-1 s1) 12)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 15)
	(= (time-to-walk p0-2 s0) 15)
	(= (time-to-walk s2 p0-2) 12)
	(= (time-to-walk p0-2 s2) 12)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 4)
	(= (time-to-drive s0 s2) 4)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 7)
	(= (time-to-drive s2 s3) 7)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 6)
	(= (time-to-drive s4 s3) 6)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 26)
	(= (time-to-drive s2 s4) 26)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 27)
	(= (time-to-drive s1 s0) 27)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 29)
	(= (time-to-drive s3 s0) 29)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 15)
	(= (time-to-drive s2 s1) 15)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s1)
	(at truck1 s4)
	(at truck2 s3)
	(at package1 s2)
	(at package2 s1)
	(at package3 s0)
	(at package4 s0)
	(at package5 s4)
	))

(:metric minimize (+ (* 4 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 9
2. (walk driver2 s4 p1-4)
   deleted: (at driver2 s4)
   added: (at driver2 p1-4)
   goals met: 1 of 9
3. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 9
4. (drive-truck truck1 s2 s3 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 0 to 77
   goals met: 1 of 9
5. (load-truck package3 truck1 s3)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 1 of 9
6. (drive-truck truck1 s3 s0 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 77 to 454
   goals met: 1 of 9
7. (walk driver2 p1-4 s1)
   deleted: (at driver2 p1-4)
   added: (at driver2 s1)
   goals met: 2 of 9
8. (unload-truck package3 truck1 s0)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 3 of 9
9. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 454 to 498
   goals met: 3 of 9
10. (walk driver2 s1 p0-1)
   deleted: (at driver2 s1)
   added: (at driver2 p0-1)
   goals met: 2 of 9
11. (walk driver2 p0-1 s0)
   deleted: (at driver2 p0-1)
   added: (at driver2 s0)
   goals met: 2 of 9
12. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 9
13. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (fuel-used) from 498 to 788
   goals met: 3 of 9
14. (disembark-truck driver2 truck2 s3)
   deleted: (driving driver2 truck2)
   added: (at driver2 s3) (empty truck2)
   goals met: 3 of 9
15. (walk driver2 s3 p1-3)
   deleted: (at driver2 s3)
   added: (at driver2 p1-3)
   goals met: 3 of 9
16. (walk driver2 p1-3 s1)
   deleted: (at driver2 p1-3)
   added: (at driver2 s1)
   goals met: 4 of 9
17. (drive-truck truck1 s2 s1 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 788 to 953
   goals met: 4 of 9
18. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 5 of 9
19. (load-truck package1 truck1 s1)
   deleted: (at package1 s1)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 5 of 9
20. (load-truck package4 truck1 s1)
   deleted: (at package4 s1)
   added: (in package4 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 5 of 9
21. (drive-truck truck1 s1 s2 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 953 to 1148
   goals met: 5 of 9
22. (unload-truck package1 truck1 s2)
   deleted: (in package1 truck1)
   added: (at package1 s2)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 6 of 9
23. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 1148 to 1192
   goals met: 6 of 9
24. (unload-truck package4 truck1 s0)
   deleted: (in package4 truck1)
   added: (at package4 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 9
25. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 1192 to 1232
   goals met: 7 of 9
26. (drive-truck truck1 s2 s4 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 1232 to 1492
   goals met: 8 of 9
27. (disembark-truck driver1 truck1 s4)
   deleted: (driving driver1 truck1)
   added: (at driver1 s4) (empty truck1)
   goals met: 9 of 9
